app/Helpers/LogActivity.php

      public static function addToLog($subject)
      {
        $log = [];
        $log['subject'] = $subject;
        $log['url'] = Request::fullUrl();
        $log['method'] = Request::method();
        $log['agent'] = Request::header('user-agent');
        $log['user_id'] = auth()->check() ? auth()->user()->id : 1;
        LogActivitiesModel::create($log);
---
insert into `log_activities` (`subject`, `url`, `method`, `agent`, `user_id`, `updated_at`, `created_at`) values ('Proses => Selesai', 'http://127.0.0.1:8000/booking-layanan/changeStatusAntrian', 'POST', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Safari/537.36', 34, '2023-09-15 14:47:34', '2023-09-15 14:47:34')