app/Http/Controllers/AntrianController.php

select * from `satker` where `id` = '9' limit 1
select * from `active_layanan` where `active_layanan`.`satker_id` = 9 and `active_layanan`.`satker_id` is not null and `status` = '1' order by `layanan_id` asc
select * from `layanan` where `layanan`.`id` = 1 limit 1
select count(*) as aggregate from `antrian` where `tanggal_hadir` = '2023-09-15' and `satker_id` = 9 and `layanan_id` = 1
select * from `antrian` where `tanggal_hadir` = '2023-09-15' and `satker_id` = 9 and `layanan_id` = 1 and `status` = '1' limit 1
---
    public function data_antrian(Request $request){
        $antrians = collect();
        $satker = SatkerModel::whereId($request->satker_id)->first();

        $satker->only_active_layanans->each(function($q) use($antrians){
            $antrian_model = AntrianModel::query()
            ->whereTanggalHadir(date('Y-m-d'))
            ->whereSatkerId($q->satker_id)
            ->whereLayananId($q->layanans->id);

            $total_antrian    = $antrian_model->count();
            $antrian_saat_ini = $antrian_model->where('status','=',"1")->first();
            $antrian_saat_ini = (!$antrian_saat_ini) ? 0 : (int)$antrian_saat_ini->nomor_antrian;

            if ($total_antrian == 0)
                $antrian_saat_ini = '000';
            if ($antrian_saat_ini > $total_antrian)
                $antrian_saat_ini = $total_antrian;
                $antrian_saat_ini = sprintf("%03s", $antrian_saat_ini);
            $antrians->push([
                'id'                => $q->layanans->id,
                'nama_layanan'      => $q->layanans->name,
                'kode_layanan'      => $q->layanans->kode,
                'color'             => $q->layanans->color,
                'icon'              => $q->layanans->icon,