app/Http/Controllers/BookingLayananController.php

select * from `antrian` where `antrian`.`id` = '16' limit 1
update `antrian` set `status` = '2', `antrian`.`updated_at` = '2023-09-15 14:47:34' where `id` = 16
---
    public function changeStatusAntrian(Request $request){
        $messages = AntrianModel::findOrFail($request->id)->update(['status' => $request->status]);

select * from `antrian` where `status` != '2' and `satker_id` = '9' and `tanggal_hadir` >= '2023-09-15' and `tanggal_hadir` <= '2023-09-15' order by `layanan` asc, `nomor_antrian` asc, `status` asc
---
            if ($request->order[0]['column'] == "0")
                return  $q->orderBy('layanan')->orderBy('nomor_antrian')->orderBy('status');

            switch ($request->order[0]['column']) {
                case '1': $order = 'provinsi_id'; break;
                case '2': $order = 'satker_id'; break;
                case '3': $order = 'user_id'; break;
                case '4': $order = 'layanan_id'; break;
                case '5': $order = 'tanggal_hadir'; break;
                case '6': $order = 'keterangan'; break;
                case '7': $order = 'nomor_antrian'; break;
                case '8': $order = 'status'; break;
                default: $order = 'nomor_antrian'; break;
            }
            return $q->orderBy($order ,$request->order[0]['dir']);
        })
        ->get();